list_a = []
for i in range(4): # iは1,2,3の値を取り、4回繰り返す
    list_a.append(2 * i) # list_aの末尾に2*iを追加する
print(list_a) # [0, 2, 4, 6]

list_b = [21, 22, 23, 24]
list_c = []
for i in range(4):
    list_c.append(list_b[i] // (3 * (i + 1))) # 計算欄へ
print(list_c)

list_d = [2, 4, 1, 6, 9, 3, 5, 7]
d = 2
while d < 12:
    list_d.pop(11 % d) # 11 % d番目（インデックス）の要素を取り出して削除する
    d += 2
print(list_d) # (27)[2, 6, 5]

list_e = [1, 2, 2, 7]
j = 0
for cd in [7, 3, 2, 6, 5]: #
    if cd in list_e: # cdがlist_eにあるかチェック
        list_e.remove(cd) # 値がcdと一致する最初の要素を削除
        list_e.insert(j, 2 * cd) # インデックスjに値2*cdを挿入
        j += 1
print(list_e) # (28) [14, 4, 1, 2]

result = ''
for e in [20, 6, -2, 12]:
    if (e + 4) ** 2 < 30:
        result += 'A'
        

'''計算欄
(28)について、各ループの処理
cd=7: list_e[14, 1, 2, 2] ※7を削除し、2*7=14をインデックス0にインサート。j=1
cd=3: list_eにないので、Falseとなり次のループへ
cd=2: list_e=[14, 4, 1, 2] ※最初の2を削除し、2*2=4をインデックス1にインサート。j=2
cd=6: list_eにないので、Falseとなり次のループへ
cd=5: list_eにないので、False。ループ終了
よって出力は[14, 4, 1, 2]


(27)の計算 dは+2なので2→4→6→8→10で推移
1回目のループ：11%2=1 → [2, 1, 6, 9, 3, 5, 7] ※4を削除
2回目のループ：11%3=3 → [2, 1, 6, 3, 5, 7] ※9を削除
3回目のループ：11%6=5 → [2, 1, 6, 3, 5] 
4回目のループ：11%8=3 → [2, 1, 6, 5]
5回目のループ：11%10=1 → [2, 6, 5]
よって答えは[2, 6, 5]となる


（26）の計算 //は切り捨て除算
1回目のループ：21 //（3 * (0 + 1)) = 7
2回目のループ：22 //（3 * (1 + 1)) = 3
3回目のループ：23 // (3 * (2 + 1)) = 2
4回目のループ：24 // (3 * (3 + 1)) = 2
list_c = [7, 3, 2, 2] 
'''